// Задача 71: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 3, n = 3 -> A(m,n) = 29
Console.WriteLine("Hello, World!");
