// Задача 67: Показать натуральные числа от N до 1, N задано.
// N = 5. -> "5, 4, 3, 2, 1"
Console.WriteLine("Hello, World!");
